Autodesk.Revit.DB.ExportLinetypeInfo.DestinationLinetypeName
The destination linetype name (the name of the linetype in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(System.String)
Constructs a new ExportLinetypeInfo using the destination linetype name as input.
destinationLinetypeName:
The destination line type name (the name of the linetype in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(Autodesk.Revit.DB.ExportLinetypeInfo)
Constructs a new copy of the input ExportLinetypeInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014